## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 0 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| update | `aws_ssm_parameter.weblate_github_credentials`               |
|        | `module.localisation_services.aws_iam_policy.this_task_exec` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.ssm_parameters will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "ssm_parameters" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ssm:GetParameter",
              + "ssm:GetParameters",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-admin-email",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-admin-password",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-host",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-password",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-username",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-github-credentials",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-secret",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-auth_token",
              + "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-url",
            ]
          + sid       = "GetWeblateSSMParameters"
        }
    }

  # aws_ssm_parameter.weblate_github_credentials will be updated in-place
  ~ resource "aws_ssm_parameter" "weblate_github_credentials" {
        id             = "weblate-github-credentials"
      + insecure_value = (known after apply)
        name           = "weblate-github-credentials"
        tags           = {
            "CostCentre"  = "platform-core-services"
            "Environment" = "staging"
            "Product"     = "localisation-services"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.localisation_services.data.aws_iam_policy_document.this_task_exec_combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this_task_exec_combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = [
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ecr:GetDownloadUrlForLayer",
                              + "ecr:GetAuthorizationToken",
                              + "ecr:BatchGetImage",
                              + "ecr:BatchCheckLayerAvailability",
                            ]
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = "logs:DescribeLogGroups"
                          + Effect   = "Allow"
                          + Resource = "*"
                        },
                      + {
                          + Action   = [
                              + "logs:PutLogEvents",
                              + "logs:DescribeLogStreams",
                              + "logs:CreateLogStream",
                            ]
                          + Effect   = "Allow"
                          + Resource = "arn:aws:logs:ca-central-1:817721384391:log-group:/aws/ecs/localisation-services:*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            ),
          + (known after apply),
        ]
    }

  # module.localisation_services.aws_iam_policy.this_task_exec will be updated in-place
  ~ resource "aws_iam_policy" "this_task_exec" {
        id        = "arn:aws:iam::817721384391:policy/weblate_ecs_task_exec_policy"
        name      = "weblate_ecs_task_exec_policy"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ecr:GetDownloadUrlForLayer",
                          - "ecr:GetAuthorizationToken",
                          - "ecr:BatchGetImage",
                          - "ecr:BatchCheckLayerAvailability",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:DescribeLogGroups"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ca-central-1:817721384391:log-group:/aws/ecs/localisation-services:*"
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-url",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-redis-auth_token",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-secret",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-google-client-id",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-github-credentials",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-username",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-password",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-database-host",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-admin-password",
                          - "arn:aws:ssm:ca-central-1:817721384391:parameter/weblate-admin-email",
                        ]
                      - Sid      = "GetWeblateSSMParameters"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {
            "CostCentre" = "platform-core-services"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
